betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rtc.h
/** @defgroup RTC_output_source_to_output_on_the_Tamper_pin Output source to output on the Tamper pin
  * @{
  */

#define RTC_OUTPUTSOURCE_NONE               0x00000000U                                  /*!< No output on the TAMPER pin  */
#define RTC_OUTPUTSOURCE_CALIBCLOCK         BAKPR_CLKCAL_CALCOEN                         /*!< RTC clock with a frequency divided by 64 on the TAMPER pin  */
#define RTC_OUTPUTSOURCE_ALARM              BAKPR_CLKCAL_ASPOEN                          /*!< Alarm pulse signal on the TAMPER pin  */
#define RTC_OUTPUTSOURCE_SECOND             (BAKPR_CLKCAL_ASPOSEL | BAKPR_CLKCAL_ASPOEN) /*!< Second pulse signal on the TAMPER pin  */

/**
  * @}
  */

/** @defgroup RTC_Automatic_Prediv_1_Second Automatic calculation of prediv for 1sec timebase
  * @{
  */
#define RTC_AUTO_1_SECOND                      0xFFFFFFFFU

/**
  * @}
  */

#endif /* APM32F403xx || APM32F402xx */

/** @defgroup RTC_Flags_Definitions RTC Flags Definitions
  * @{
  */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define RTC_FLAG_RECALPF                  RTC_STS_RCALPFLG      /*!< Recalibration pending flag               */
#if defined(RTC_TAMPER2_SUPPORT)
#define RTC_FLAG_TAMP2F                   RTC_STS_TP2FLG        /*!< Tamper 2 event flag                      */
#endif /* RTC_TAMPER2_SUPPORT */
#define RTC_FLAG_TAMP1F                   RTC_STS_TP1FLG        /*!< Tamper 1 event flag                      */
#define RTC_FLAG_TSOVF                    RTC_STS_TSOVRFLG      /*!< Timestamp overflow flag                  */
#define RTC_FLAG_TSF                      RTC_STS_TSFLG         /*!< Timestamp event flag                     */
#define RTC_FLAG_WUTF                     RTC_STS_WUTFLG        /*!< Wakeup timer event flag                  */
#define RTC_FLAG_ALRBF                    RTC_STS_ALRBFLG       /*!< Alarm B event flag                       */
#define RTC_FLAG_ALRAF                    RTC_STS_ALRAFLG       /*!< Alarm A event flag                       */
#define RTC_FLAG_INITF                    RTC_STS_RINITFLG      /*!< RTC in initialization mode flag          */
#define RTC_FLAG_RSF                      RTC_STS_RSFLG         /*!< Register synchronization flag            */
#define RTC_FLAG_INITS                    RTC_STS_INITSFLG      /*!< RTC initialization status flag           */
#define RTC_FLAG_SHPF                     RTC_STS_SOPFLG        /*!< Shift operation pending flag             */
#define RTC_FLAG_WUTWF                    RTC_STS_WUTWFLG       /*!< WUTR register write allowance flag       */
#define RTC_FLAG_ALRBWF                   RTC_STS_ALRBWFLG      /*!< ALRMBR register write allowance flag     */
#define RTC_FLAG_ALRAWF                   RTC_STS_ALRAWFLG      /*!< ALRMAR register write allowance flag     */
#else
#define RTC_FLAG_RTOFF                    RTC_CSTS_OCFLG        /*!< RTC Operation OFF flag                   */
#define RTC_FLAG_RSF                      RTC_CSTS_RSYNCFLG     /*!< Registers Synchronized flag              */
#define RTC_FLAG_OW                       RTC_CSTS_OVRFLG       /*!< Overflow flag                            */
#define RTC_FLAG_ALRAF                    RTC_CSTS_ALRFLG       /*!< Alarm flag                               */
#define RTC_FLAG_SEC                      RTC_CSTS_SECFLG       /*!< Second flag                              */
#define RTC_FLAG_TAMP1F                   BAKPR_CSTS_TEFLG      /*!< Tamper Interrupt Flag                    */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/

/** @defgroup RTC_Exported_Macros RTC Exported Macros
  * @{
  */

/** @brief Reset RTC handle state
  * @param  __HANDLE__ specifies the RTC handle.
  * @retval None
  */
#if (USE_DAL_RTC_REGISTER_CALLBACKS == 1)
#define __DAL_RTC_RESET_HANDLE_STATE(__HANDLE__) do {                                            \
                                                      (__HANDLE__)->State = DAL_RTC_STATE_RESET; \
                                                      (__HANDLE__)->MspInitCallback = NULL;      \
                                                      (__HANDLE__)->MspDeInitCallback = NULL;    \
                                                    } while(0U)
#else
#define __DAL_RTC_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = DAL_RTC_STATE_RESET)
#endif /* USE_DAL_RTC_REGISTER_CALLBACKS */

/**
  * @brief  Disable the write protection for RTC registers.
  * @param  __HANDLE__ specifies the RTC handle.
  * @retval None
  */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RTC_WRITEPROTECTION_DISABLE(__HANDLE__) do {                                       \
                                                           (__HANDLE__)->Instance->WRPROT = 0xCAU;  \
                                                           (__HANDLE__)->Instance->WRPROT = 0x53U;  \
                                                         } while(0U)
#else
#define __DAL_RTC_WRITEPROTECTION_DISABLE(__HANDLE__)         SET_BIT((__HANDLE__)->Instance->CSTS, RTC_CSTS_CFGMFLG)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @brief  Enable the write protection for RTC registers.
  * @param  __HANDLE__ specifies the RTC handle.
  * @retval None
  */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RTC_WRITEPROTECTION_ENABLE(__HANDLE__) do {                                       \
                                                          (__HANDLE__)->Instance->WRPROT = 0xFFU;  \
                                                        } while(0U)
#else
#define __DAL_RTC_WRITEPROTECTION_ENABLE(__HANDLE__)          CLEAR_BIT((__HANDLE__)->Instance->CSTS, RTC_CSTS_CFGMFLG)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

